In [1]:
import pandas as pd

### DataFrame

### (EX 1-4) Dictionary -> DataFrame

In [8]:
dict_data = {'c0':[1,2,3],'c1':[4,5,6],'c2':[7,8,9],'c3':[10,11,12],'c4':[13,14,15]}

df = pd.DataFrame(dict_data)

In [9]:
type(df)

pandas.core.frame.DataFrame

In [10]:
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

### (Ex 1-5) List -> DataFrame

In [12]:
df = pd.DataFrame([
    [15,'남','여명중'],
    [17,'여','수리중']],
    index=['준서', '예은'],
    columns=['나이','성별','학교']
)

df

    나이 성별   학교
준서  15  남  여명중
예은  17  여  수리중

#### DataFrame Index/Columns Handling

In [13]:
df.index

Index(['준서', '예은'], dtype='object')

In [14]:
df.columns

Index(['나이', '성별', '학교'], dtype='object')

##### WARNING!!! Dictionary->DataFrame은 list가 column vector로 가지만 list->dataframe은 list가 row로 감!!!

#### Index/Column 이름 변경 - df.index df.columns

In [17]:
df.index = ['학생1','학생2']
df.columns= ['연령','남녀','소속']

In [18]:
df

     연령 남녀   소속
학생1  15  남  여명중
학생2  17  여  수리중

#### Index/Column 이름 변경 - df.rename

In [24]:
df.rename(index={'학생1':'준서','학생2':'예은'}, inplace=True) #new dataframe object을 반환!!! inplace 해야됨
df.rename(columns={'연령':'나이','남녀':'sex'}, inplace=True)

In [25]:
df

    나이 sex   소속
준서  15   남  여명중
예은  17   여  수리중

### Drop Columns/Index

In [27]:
df

    나이 sex   소속
준서  15   남  여명중
예은  17   여  수리중

In [32]:
df.drop('sex', axis=1)

    나이   소속
준서  15  여명중
예은  17  수리중

In [34]:
df.drop('준서', axis=0)

    나이 sex   소속
예은  17   여  수리중

In [35]:
df # inplace = True 해줘야됨!!

    나이 sex   소속
준서  15   남  여명중
예은  17   여  수리중

In [36]:
df.drop(['sex','소속'],axis=1)

    나이
준서  15
예은  17

In [37]:
df

    나이 sex   소속
준서  15   남  여명중
예은  17   여  수리중